#ifndef BINARY_SEARCH_TREE_H
#define BINARY_SEARCH_TREE_H
#include <string>
#include <iostream>
using namespace std;
//ΔΗΛΩΣΗ ΤΗΣ ΚΛΑΣΗΣ ΔΥΑΔΙΚΟΥ ΔΕΝΤΡΟΥ ΑΝΑΖΗΤΗΣ

class bst{//ΚΛΑΣΗ ΓΙΑ ΤΟ ΔΥΑΔΙΚΟ ΔΕΝΤΡΟ ΑΝΑΖΗΤΗΣ
private:
string *bt,*bt2;//ΑΝΑΠΑΡΑΣΤΑΣΗ ΔΥΑΔΙΚΟΥ ΔΕΝΔΡΟΥ ΑΝΑΖΗΤΗΣΗΣ ΣΕ ΠΙΝΑΚΑ,ΥΠΟΛΟΙΠΟΜΕΝΑ ΣΤΟΙΧΕΙΑ ΔΥΑΔΙΚΟΥ ΔΕΝΤΡΟΥ
int *count, size,pos2,size2,*count2;//ΠΙΝΑΚΑΣ ΜΕ ΤΟ ΠΗΘΟΣ ΕΜΦΑΝΙΣΕΩΝ ΤΩΝ ΖΕΥΓΑΡΙΩΝ, ΜΕΓΕΘΟΣ ΤΟΥ ΠΙΝΑΚΑ ΑΝΑΠΑΡΑΣΤΑΣΗΣ ΔΥΑΔΙΚΟΥ ΔΕΝΔΡΟΥ
public:
bst();//constructor για την κατασκευή αντικειμένων
~bst();//destructor για την διαγραφή αντικειμένων
void insert(string x);//συνάρτηση για την εισαγωγή του ζευγαριού
int search_string(string x,int &pos);//συνάρτηση για την αναζήτηση του ζευγαριού στο δυαδικο δενδρο αναζητησης
void search(string Q[]);//συνάρτηση για την αναζήτηση των ζευγαριών του συνόλου Q στο δυαδικο δενδρο αναζητησης και εκτύπωση των κατάλληλων πληροφοριών
};
#endif
