#ifndef CLASSIFIED_ARRAY_H
#define CLASSIFIED_ARRAY_H
#include <string>
using namespace std;
//ΔΗΛΩΣΗ ΤΗΣ ΚΛΑΣΗΣ ΤΑΞΙΝΟΜΗΜΕΝΟΥ ΠΙΝΑΚΑ
class cda{//ΚΛΑΣΗ ΓΙΑ ΤΑΞΙΝΟΜΗΜΕΝΟ ΠΙΝΑΚΑ
private:string *ca;//Πίνακας για τον δομημένο πίνακα
int *count, size, p;// Πίνακας για το πλήθος εμφανίσεων ζευγαριών, μέγεθος πίνακα, θέση του τελευταίου στοιχείου
public:
cda();//constructor για την κατασκευή αντικειμένων
~cda();//destructor για την διαγραφή αντικειμένων
void push(string x);//συνάρτηση για την εισαγωγή του ζευγαριού
bool binary_search_string(string x,int &pos);//συνάρτηση για την αναζήτηση του ζευγαριού στον πίνακα
void search(string Q[]);//συνάρτηση για την αναζήτηση των ζευγαριών του συνόλου Q στον πίνακα και εκτύπωση των κατάλληλων πληροφοριών
void sort();//ΤΟΠΟΘΕΤΗΣΗ ΤΟΥ ΝΕΟΥ ΖΕΥΓΑΡΙΟΥ ΣΤΗΝ ΚΑΤΑΛΛΗΛΗ ΘΕΣΗ ΩΣΤΕ Η ΤΑΞΙΝΟΜΗΣΗ ΝΑ ΕΙΝΑΙ ΦΘΙΝΟΥΣΑ
};


#endif